; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c2-s6-p9-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 
          t0 t1 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (TRUCK t0)
    (TRUCK t1)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (at t0 l0-3)
    (at t1 l1-5)
    (at p0 l0-0)
    (at p1 l1-2)
    (at p2 l0-1)
    (at p3 l0-3)
    (at p4 l0-4)
    (at p5 l0-4)
    (at p6 l1-4)
    (at p7 l1-5)
    (at p8 l1-3)
    (at a0 l1-0)
    (at a1 l0-0)
)
(:goal
    (and
        (at p0 l1-0)
        (at p1 l0-0)
        (at p2 l0-3)
        (at p3 l0-3)
        (at p4 l1-0)
        (at p5 l1-4)
        (at p6 l1-0)
        (at p7 l0-2)
        (at p8 l0-0)
    )
)

  (:constraints
    (and
      (always (not (in p2 a0)))
      (always (not (in p2 a1)))
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p6 a0)))
      (always (not (in p6 a1)))
    )
  )
)

; plan
1. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 1 of 9
2. (load-truck p7 t1 l1-5)
   deleted: (at p7 l1-5)
   added: (in p7 t1)
   goals met: 1 of 9
3. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 1 of 9
4. (drive-truck t0 l0-3 l0-4 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-4)
   goals met: 1 of 9
5. (drive-truck t1 l1-5 l1-4 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-4)
   goals met: 1 of 9
6. (load-airplane p0 a0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 1 of 9
7. (load-truck p5 t0 l0-4)
   deleted: (at p5 l0-4)
   added: (in p5 t0)
   goals met: 1 of 9
8. (load-truck p4 t0 l0-4)
   deleted: (at p4 l0-4)
   added: (in p4 t0)
   goals met: 1 of 9
9. (load-truck p6 t1 l1-4)
   deleted: (at p6 l1-4)
   added: (in p6 t1)
   goals met: 1 of 9
10. (drive-truck t0 l0-4 l0-2 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-2)
   goals met: 1 of 9
11. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 1 of 9
12. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 2 of 9
13. (drive-truck t1 l1-4 l1-3 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-3)
   goals met: 2 of 9
14. (drive-truck t0 l0-2 l0-1 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-1)
   goals met: 2 of 9
15. (load-truck p8 t1 l1-3)
   deleted: (at p8 l1-3)
   added: (in p8 t1)
   goals met: 2 of 9
16. (load-truck p2 t0 l0-1)
   deleted: (at p2 l0-1)
   added: (in p2 t0)
   goals met: 2 of 9
17. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 2 of 9
18. (drive-truck t1 l1-3 l1-4 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-4)
   goals met: 2 of 9
19. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 2 of 9
20. (drive-truck t1 l1-4 l1-2 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-2)
   goals met: 2 of 9
21. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 2 of 9
22. (load-truck p1 t1 l1-2)
   deleted: (at p1 l1-2)
   added: (in p1 t1)
   goals met: 2 of 9
23. (unload-truck p5 t0 l0-0)
   deleted: (in p5 t0)
   added: (at p5 l0-0)
   goals met: 2 of 9
24. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 2 of 9
25. (drive-truck t1 l1-2 l1-4 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-4)
   goals met: 2 of 9
26. (load-airplane p5 a0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a0)
   goals met: 2 of 9
27. (load-airplane p4 a0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 2 of 9
28. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 2 of 9
29. (unload-truck p2 t0 l0-3)
   deleted: (in p2 t0)
   added: (at p2 l0-3)
   goals met: 3 of 9
30. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 3 of 9
31. (drive-truck t1 l1-4 l1-0 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-0)
   goals met: 3 of 9
32. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 3 of 9
33. (unload-airplane p5 a0 l1-0)
   deleted: (in p5 a0)
   added: (at p5 l1-0)
   goals met: 3 of 9
34. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 3 of 9
35. (unload-truck p7 t1 l1-0)
   deleted: (in p7 t1)
   added: (at p7 l1-0)
   goals met: 3 of 9
36. (unload-truck p1 t1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 3 of 9
37. (unload-airplane p4 a0 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 4 of 9
38. (unload-truck p6 t1 l1-0)
   deleted: (in p6 t1)
   added: (at p6 l1-0)
   goals met: 5 of 9
39. (load-airplane p8 a0 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a0)
   goals met: 5 of 9
40. (load-airplane p7 a0 l1-0)
   deleted: (at p7 l1-0)
   added: (in p7 a0)
   goals met: 5 of 9
41. (load-airplane p1 a0 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 5 of 9
42. (load-truck p5 t1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 5 of 9
43. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 5 of 9
44. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 5 of 9
45. (drive-truck t1 l1-0 l1-4 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-4)
   goals met: 5 of 9
46. (unload-truck p5 t1 l1-4)
   deleted: (in p5 t1)
   added: (at p5 l1-4)
   goals met: 6 of 9
47. (unload-airplane p8 a0 l0-0)
   deleted: (in p8 a0)
   added: (at p8 l0-0)
   goals met: 7 of 9
48. (unload-airplane p7 a0 l0-0)
   deleted: (in p7 a0)
   added: (at p7 l0-0)
   goals met: 7 of 9
49. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 8 of 9
50. (load-truck p7 t0 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 t0)
   goals met: 8 of 9
51. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 8 of 9
52. (unload-truck p7 t0 l0-2)
   deleted: (in p7 t0)
   added: (at p7 l0-2)
   goals met: 9 of 9
